[
  {
    "source": "https://caps.ucsd.edu/services/groups.html#Psychotherapy-and-Support-Group",
    "content": "Group approaches to personal growth are frequently the most effective way to explore and support changes you may wish to make in your life. Through these formats, students can gain specific skills and strategies to meet personal goals, explore areas that present personal challenges, and gain support and encouragement from other students. CAPS offers a wide range of Groups in various formats to serve the diverse needs of the UC San Diego Community. These formats are:test\n \nWorkshops meet regularly. Because these workshops focus on the acquisition and practice of specific skills, these workshops typically meet for a shorter period of time (e.g., one quarter) than the other group formats. To join one of our workshops, please contact the leader(s) to get more information.\nCommunity Connections are drop-in groups that meet throughout the academic year and do not require weekly attendance.\nWinter 2025 Schedule (pdf)\nThese groups typically meet weekly throughout the quarter except where indicated. Regular attendance is expected. To join one of these groups, please contact the leader(s) to get more information.\nIf you have any further questions about Groups, please contact the CAPS Central Office at (858) 534-3755.\n \n \nTritons RISE Workshops\nJoin CAPS and our partners with our RISE Performance Workshops. Based on principles from peak performance and the field of positive psychology, our RISE Workshops are here to promote you reaching your peak in all areas of your life: emotional, physical, and social. \nVisit our Tritons RISE Together page for more information.\nWinter 2025 Schedule (pdf)\nNOTE: CAPS programs are open to all currently registered UC San Diego students, regardless of race, color, national origin, or any other protected status. These meetings are not professional counseling. If you would like professional counseling or mental health treatment, please call the CAPS Central Office at (858) 534-3755 or go to our Getting Started page to arrange an appointment.\nIf you are interested in joining a psychotherapy group, please contact the group leader to schedule a group screening appointment. Currently psychotherapy groups meet virtually. Prior to the first group meeting, participants will need to complete the Group Virtual Consent Form and send the form back to the group leader through MyStudentChart or the MyChart app.\nTaming Anxiety Group\n\nManage stress, tame anxiety, and work on your well-being. This is a CBT (cognitive-behavioral therapy) group to learn how to better manage stress and anxiety. Topics covered include how to identify and change anxious thought patterns, reducing worry and avoidance, managing panic, improving sleep, and increasing well-being. Each week students will learn effective strategies that they can immediately apply to help tame anxiety. \n \nWINTER QUARTER 2025:\nBuilding Social Confidence Group\n\nWould you like to improve the quality of social interactions and the availability of social support? This group focuses on identifying fears related to social situations, reducing self-defeating coping patterns and strengthening effective social skills. It combines an educational and support approach. Topics covered are tailored for each group, and have included building conversation skills (how to start, sustain, and end conversations), assertiveness training, how to speak up in class, and how to reduce anxiety in social situations such as dating, parties, or professional meetings.\nThis group is not offered in the Winter 2025 Quarter, but if you are interested in joining in a future quarter, please send an email to Dr. Tiffany O'Meara, Ph.D. at tmomeara@health.ucsd.edu or fill out the online request form to be added to the group list.\nAdvanced Building Social Confidence/Advanced Anxiety Group\n\nThis is a group for students who have completed one quarter of the Building Social Confidence OR Taming Anxiety group and would like to continue to work on reducing anxiety, increasing comfort in social situations and increasing their self-confidence. Students get more individualized attention in this group, and topics are dictated by the group members. Come share your own experiences and challenges, and get feedback and support from a caring group of students who share similar experiences. Once you've completed one BSC or TA group, you may join the Advanced group at any time while you are here at UCSD!\nWINTER QUARTER 2025:\nBody Image Group\nThis is a group to create space for understanding the many factors that influence our relationship with our bodies and to find different strategies for moving toward healing with your body. It uses evidence-based techniques to change the way you think about, feel about, and interact with your body.\nThis group is for students who are already in the SHW ED Treatment Program. For more information contact your CAPS Therapist.\nPEERS® for Young Adults is an evidence-based social skills program designed for motivated young adults with Autism Spectrum Disorder (ASD) who are interested in making friends and building relationships. In these engaging workshops, students will learn social skills, watch video demonstrations, and practice these skills during group socialization activities! Students make a commitment to attend 8 weekly group sessions for 90 minutes per week. Students do not need to be diagnosed with ASD in order to attend the group. This group is for any student who struggles in social situations, is having difficulty making and sustaining friendships, and wants to learn/ enhance social skills.\nWINTER QUARTER 2025:\nFlyer (PDF)\nDBT Skills Group\nThis group is focused on learning tangible skills for increasing awareness of the present moment, understanding and changing emotional experiences, and tolerating distress without using eating disorder behaviors.\nThis group is not offered in the Winter 2025 quarter, but if you are interested in joining in a future quarter, please send an email to Allie Wagner, Ph.D. at afwagner@health.ucsd.edu.\nMeal Support Hour\nThis group is focused on providing a safe and supportive space for those in recovery from an eating disorder to build community as we share a meal. Bring your own meal.\nThis group is for students who are already in the SHW Eating Disorders Program. For more information, contact your CAPS therapist.\n \nWINTER QUARTER 2025:\nACT for Chronic Pain Group\nDo you have long-standing chronic pain that is getting in the way of you participating in life? People who have chronic pain often try all sorts of methods to make their pain go away, only to feel stuck in a discouraging and futile struggle that causes their life and what’s important to them to take a back seat to the pain of the day. In this 8-week therapy group, participants will learn evidence-based skills to develop a healthier relationship with their pain, so that they can live a fuller and more meaningful life.\nWINTER QUARTER 2025:\n\n\nUC San Diego 9500 Gilman Dr. La Jolla, CA 92093 (858) 534-2230\n\n\n        Copyright © 2025 Regents of the University of California.\n        All rights reserved.\n        \n"
  },
  {
    "source": "https://caps.ucsd.edu/services/letstalk.html",
    "content": " \n\"Let’s Talk” is a service offered by UC San Diego CAPS (Counseling and Psychological Services) to students who are seeking informal support with mental health and campus resources. While this does not constitute formal mental health treatment, Let’s Talk sessions are designed to provide practical strategies, information, and support regarding general wellness-related issues. This is a great opportunity to chat with a mental health professional and ask questions about your well-being, accessing resources, and getting connected with CAPS.\nPlease note: Students are limited to 2 sessions per quarter. Please do not sign-up for more than 2 meetings in a single quarter.\nWinter 2025 SCHEDULE (PDF)\nWe are also pleased to offer a weekly drawing for a $25 gift card for those who complete the feedback survey. If you are interested, please add your email address on the last question of the feedback survey to enter the random drawing\nHow do I sign-up?\nNOTE: Let’s Talk is not professional counseling. It is not appropriate for urgent concerns or mental health emergencies. If you would like professional counseling or mental health treatment, please call the CAPS Central Office at (858) 534-3755 or go to our Getting Started page to arrange an appointment.\n\nUC San Diego 9500 Gilman Dr. La Jolla, CA 92093 (858) 534-2230\n\n\n        Copyright © 2025 Regents of the University of California.\n        All rights reserved.\n        \n"
  },
  {
    "source": "https://caps.ucsd.edu/resources/iflourish.html#Headspace",
    "content": " \n \niFLOURISH represents UC San Diego CAPS’ commitment to innovative, self-guided technology programs that provide mental health at your fingertips. As part of the Tritons Flourish Initiative, CAPS is offering several online-based programs for mental health that provide evidence-based intervention and interactive help at all times. All tools are FREE, anonymous, and only available to UC San Diego students. You don’t have to be a CAPS client to signup.The descriptions and links to signup are below. Please be sure to use your UC San Diego email address to get access. All programs are anonymous, and CAPS does not track your usage. All are desktop, mobile, or tablet-friendly! Each tool provides a little something different, so you can signup for all of them for comprehensive wellbeing.\n\nYou can take an anonymous online behavioral health screening for the following areas:\nBEHAVIORAL HEALTH SCREENING\n \n\n \nHeadspace for Tritons is here! The popular mindfulness app and all its upgraded \"Plus\" features, is now FREE for registered UC San Diego students and up to 5 invited loved ones!\nBe kind to your mind! Headspace is one of the most popular mindfulness apps (40 million users) that teaches you how to meditate in your everyday life. Meditation has been shown to help people stress less, increase focus, and sleep more soundly. Headspace will teach you the life-changing skills of meditation and mindfulness in just a few minutes a day! Use anywhere, anytime. This membership unlocks Headspace Plus, which includes hundreds of meditations and exercises for sleep, anxiety, focus, and fitness. Sign up using your \"@ucsd.edu\" email account. Start meditating today!\nSign-up for Headspace here\nWant to share the gift of mindfulness? We now offer FREE access to Headspace of up to 5 friends and/or family members! Please see below for instructions on adding other accounts.\nFAMILY PLAN INSTRUCTIONS (PDF)\nIf you are coming into the current quarter as a new UC San Diego student, please allow 3-4 weeks into the quarter for your name to be added to the list of emails eligible to sign up for free Headspace.\n\nPlease note: If you are unable to enroll using the steps above, please clear the cache by following these steps.\nFor more help following the steps above, please view the video tutorials below:\n\n \niRelax, you relax, we all can relax! Below are audio relaxation recordings. These mp3 downloads were recorded by CAPS staff. We also have a selection of recordings in other languages.\n \n\nWillo is your all-in-one self-care app designed by and for UC San Diego students to help provide a supportive and relatable platform for prioritizing mental well-being. With Willo, students can:\nFor more information or to get started, visit the Willo website. \n\nUC San Diego 9500 Gilman Dr. La Jolla, CA 92093 (858) 534-2230\n\n\n        Copyright © 2025 Regents of the University of California.\n        All rights reserved.\n        \n"
  }
]